zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32cxsg61100-pinctrl.h
/* pb1d_sercom5_pad3 */
#define PB1D_SERCOM5_PAD3 \
	PIC32CXSG_PINMUX(b, 1, d, periph)

/* pb1e_tc7_wo1 */
#define PB1E_TC7_WO1 \
	PIC32CXSG_PINMUX(b, 1, e, periph)

/* pb1n_ccl_in2 */
#define PB1N_CCL_IN2 \
	PIC32CXSG_PINMUX(b, 1, n, periph)

/* pb2_gpio */
#define PB2_GPIO \
	PIC32CXSG_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 \
	PIC32CXSG_PINMUX(b, 2, a, periph)

/* pb2b_adc0_ain14 */
#define PB2B_ADC0_AIN14 \
	PIC32CXSG_PINMUX(b, 2, b, periph)

/* pb2b_ptc_xy20 */
#define PB2B_PTC_XY20 \
	PIC32CXSG_PINMUX(b, 2, b, periph)

/* pb2d_sercom5_pad0 */
#define PB2D_SERCOM5_PAD0 \
	PIC32CXSG_PINMUX(b, 2, d, periph)

/* pb2e_tc6_wo0 */
#define PB2E_TC6_WO0 \
	PIC32CXSG_PINMUX(b, 2, e, periph)

/* pb2f_tcc2_wo2 */
#define PB2F_TCC2_WO2 \
	PIC32CXSG_PINMUX(b, 2, f, periph)

/* pb2n_ccl_out0 */
#define PB2N_CCL_OUT0 \
	PIC32CXSG_PINMUX(b, 2, n, periph)

/* pb3_gpio */
#define PB3_GPIO \
	PIC32CXSG_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 \
	PIC32CXSG_PINMUX(b, 3, a, periph)

/* pb3b_adc0_ain15 */
#define PB3B_ADC0_AIN15 \
	PIC32CXSG_PINMUX(b, 3, b, periph)

/* pb3b_ptc_xy21 */
#define PB3B_PTC_XY21 \
	PIC32CXSG_PINMUX(b, 3, b, periph)

/* pb3d_sercom5_pad1 */
#define PB3D_SERCOM5_PAD1 \
	PIC32CXSG_PINMUX(b, 3, d, periph)

/* pb3e_tc6_wo1 */
#define PB3E_TC6_WO1 \
	PIC32CXSG_PINMUX(b, 3, e, periph)

/* pb4_gpio */
#define PB4_GPIO \
	PIC32CXSG_PINMUX(b, 4, gpio, gpio)

/* pb4a_eic_extint4 */
#define PB4A_EIC_EXTINT4 \
	PIC32CXSG_PINMUX(b, 4, a, periph)

/* pb4b_adc1_ain6 */
#define PB4B_ADC1_AIN6 \
	PIC32CXSG_PINMUX(b, 4, b, periph)

/* pb4b_ptc_xy22 */
#define PB4B_PTC_XY22 \
	PIC32CXSG_PINMUX(b, 4, b, periph)

/* pb5_gpio */
#define PB5_GPIO \
	PIC32CXSG_PINMUX(b, 5, gpio, gpio)

/* pb5a_eic_extint5 */
#define PB5A_EIC_EXTINT5 \
	PIC32CXSG_PINMUX(b, 5, a, periph)

/* pb5b_adc1_ain7 */
#define PB5B_ADC1_AIN7 \
	PIC32CXSG_PINMUX(b, 5, b, periph)

/* pb5b_ptc_xy23 */
#define PB5B_PTC_XY23 \
	PIC32CXSG_PINMUX(b, 5, b, periph)

/* pb6_gpio */
#define PB6_GPIO \
	PIC32CXSG_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 \
	PIC32CXSG_PINMUX(b, 6, a, periph)

/* pb6b_adc1_ain8 */
#define PB6B_ADC1_AIN8 \
	PIC32CXSG_PINMUX(b, 6, b, periph)

/* pb6b_ptc_xy24 */
#define PB6B_PTC_XY24 \
	PIC32CXSG_PINMUX(b, 6, b, periph)

/* pb6n_ccl_in6 */
#define PB6N_CCL_IN6 \
	PIC32CXSG_PINMUX(b, 6, n, periph)

/* pb7_gpio */
#define PB7_GPIO \
	PIC32CXSG_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 \
	PIC32CXSG_PINMUX(b, 7, a, periph)

/* pb7b_adc1_ain9 */
#define PB7B_ADC1_AIN9 \
	PIC32CXSG_PINMUX(b, 7, b, periph)

/* pb7b_ptc_xy25 */
#define PB7B_PTC_XY25 \
	PIC32CXSG_PINMUX(b, 7, b, periph)

/* pb7n_ccl_in7 */
#define PB7N_CCL_IN7 \
	PIC32CXSG_PINMUX(b, 7, n, periph)

/* pb8_gpio */
#define PB8_GPIO \
	PIC32CXSG_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 \
	PIC32CXSG_PINMUX(b, 8, a, periph)

/* pb8b_adc0_ain2 */
#define PB8B_ADC0_AIN2 \
	PIC32CXSG_PINMUX(b, 8, b, periph)

/* pb8b_adc1_ain0 */
#define PB8B_ADC1_AIN0 \
	PIC32CXSG_PINMUX(b, 8, b, periph)

/* pb8b_ptc_xy1 */
#define PB8B_PTC_XY1 \
	PIC32CXSG_PINMUX(b, 8, b, periph)

/* pb8d_sercom4_pad0 */
#define PB8D_SERCOM4_PAD0 \
	PIC32CXSG_PINMUX(b, 8, d, periph)

/* pb8e_tc4_wo0 */
#define PB8E_TC4_WO0 \
	PIC32CXSG_PINMUX(b, 8, e, periph)

/* pb8n_ccl_in8 */
#define PB8N_CCL_IN8 \
	PIC32CXSG_PINMUX(b, 8, n, periph)

/* pb9_gpio */
#define PB9_GPIO \
	PIC32CXSG_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 \
	PIC32CXSG_PINMUX(b, 9, a, periph)

/* pb9b_adc0_ain3 */
#define PB9B_ADC0_AIN3 \
	PIC32CXSG_PINMUX(b, 9, b, periph)

/* pb9b_adc1_ain1 */
#define PB9B_ADC1_AIN1 \
	PIC32CXSG_PINMUX(b, 9, b, periph)

/* pb9b_ptc_xy2 */
#define PB9B_PTC_XY2 \
	PIC32CXSG_PINMUX(b, 9, b, periph)

/* pb9d_sercom4_pad1 */
#define PB9D_SERCOM4_PAD1 \
	PIC32CXSG_PINMUX(b, 9, d, periph)

/* pb9e_tc4_wo1 */
#define PB9E_TC4_WO1 \
	PIC32CXSG_PINMUX(b, 9, e, periph)

/* pb9n_ccl_out2 */
#define PB9N_CCL_OUT2 \
	PIC32CXSG_PINMUX(b, 9, n, periph)

/* pb10_gpio */
#define PB10_GPIO \
	PIC32CXSG_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 \
	PIC32CXSG_PINMUX(b, 10, a, periph)

/* pb10d_sercom4_pad2 */
#define PB10D_SERCOM4_PAD2 \
	PIC32CXSG_PINMUX(b, 10, d, periph)

/* pb10e_tc5_wo0 */
#define PB10E_TC5_WO0 \
	PIC32CXSG_PINMUX(b, 10, e, periph)

/* pb10f_tcc0_wo4 */
#define PB10F_TCC0_WO4 \
	PIC32CXSG_PINMUX(b, 10, f, periph)

/* pb10g_tcc1_wo0 */
#define PB10G_TCC1_WO0 \
	PIC32CXSG_PINMUX(b, 10, g, periph)

/* pb10h_qspi_sck */
#define PB10H_QSPI_SCK \
	PIC32CXSG_PINMUX(b, 10, h, periph)

/* pb10i_sdhc0_dat3 */
#define PB10I_SDHC0_DAT3 \
	PIC32CXSG_PINMUX(b, 10, i, periph)

/* pb10j_iis_sdi */
#define PB10J_IIS_SDI \
	PIC32CXSG_PINMUX(b, 10, j, periph)

/* pb10m_gclk_io4 */
#define PB10M_GCLK_IO4 \
	PIC32CXSG_PINMUX(b, 10, m, periph)

/* pb10n_ccl_in11 */
#define PB10N_CCL_IN11 \
	PIC32CXSG_PINMUX(b, 10, n, periph)

/* pb11_gpio */
#define PB11_GPIO \
	PIC32CXSG_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 \
	PIC32CXSG_PINMUX(b, 11, a, periph)

/* pb11d_sercom4_pad3 */
#define PB11D_SERCOM4_PAD3 \
	PIC32CXSG_PINMUX(b, 11, d, periph)

/* pb11e_tc5_wo1 */
#define PB11E_TC5_WO1 \
	PIC32CXSG_PINMUX(b, 11, e, periph)

/* pb11f_tcc0_wo5 */
#define PB11F_TCC0_WO5 \
	PIC32CXSG_PINMUX(b, 11, f, periph)

/* pb11g_tcc1_wo1 */
#define PB11G_TCC1_WO1 \
	PIC32CXSG_PINMUX(b, 11, g, periph)

/* pb11h_qspi_cs */
#define PB11H_QSPI_CS \
	PIC32CXSG_PINMUX(b, 11, h, periph)

/* pb11i_sdhc0_ck */
#define PB11I_SDHC0_CK \
	PIC32CXSG_PINMUX(b, 11, i, periph)

/* pb11j_iis_fs1 */
#define PB11J_IIS_FS1 \
	PIC32CXSG_PINMUX(b, 11, j, periph)

/* pb11m_gclk_io5 */
#define PB11M_GCLK_IO5 \
	PIC32CXSG_PINMUX(b, 11, m, periph)

/* pb11n_ccl_out1 */
#define PB11N_CCL_OUT1 \
	PIC32CXSG_PINMUX(b, 11, n, periph)

/* pb12_gpio */
#define PB12_GPIO \
	PIC32CXSG_PINMUX(b, 12, gpio, gpio)

