zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32cxsg61100-pinctrl.h
/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 \
	PIC32CXSG_PINMUX(b, 12, a, periph)

/* pb12b_ptc_xy26 */
#define PB12B_PTC_XY26 \
	PIC32CXSG_PINMUX(b, 12, b, periph)

/* pb12c_sercom4_pad0 */
#define PB12C_SERCOM4_PAD0 \
	PIC32CXSG_PINMUX(b, 12, c, periph)

/* pb12e_tc4_wo0 */
#define PB12E_TC4_WO0 \
	PIC32CXSG_PINMUX(b, 12, e, periph)

/* pb12f_tcc3_wo0 */
#define PB12F_TCC3_WO0 \
	PIC32CXSG_PINMUX(b, 12, f, periph)

/* pb12g_tcc0_wo0 */
#define PB12G_TCC0_WO0 \
	PIC32CXSG_PINMUX(b, 12, g, periph)

/* pb12h_can1_tx */
#define PB12H_CAN1_TX \
	PIC32CXSG_PINMUX(b, 12, h, periph)

/* pb12i_sdhc0_cd */
#define PB12I_SDHC0_CD \
	PIC32CXSG_PINMUX(b, 12, i, periph)

/* pb12j_iis_sck1 */
#define PB12J_IIS_SCK1 \
	PIC32CXSG_PINMUX(b, 12, j, periph)

/* pb12m_gclk_io6 */
#define PB12M_GCLK_IO6 \
	PIC32CXSG_PINMUX(b, 12, m, periph)

/* pb13_gpio */
#define PB13_GPIO \
	PIC32CXSG_PINMUX(b, 13, gpio, gpio)

/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 \
	PIC32CXSG_PINMUX(b, 13, a, periph)

/* pb13b_ptc_xy27 */
#define PB13B_PTC_XY27 \
	PIC32CXSG_PINMUX(b, 13, b, periph)

/* pb13c_sercom4_pad1 */
#define PB13C_SERCOM4_PAD1 \
	PIC32CXSG_PINMUX(b, 13, c, periph)

/* pb13e_tc4_wo1 */
#define PB13E_TC4_WO1 \
	PIC32CXSG_PINMUX(b, 13, e, periph)

/* pb13f_tcc3_wo1 */
#define PB13F_TCC3_WO1 \
	PIC32CXSG_PINMUX(b, 13, f, periph)

/* pb13g_tcc0_wo1 */
#define PB13G_TCC0_WO1 \
	PIC32CXSG_PINMUX(b, 13, g, periph)

/* pb13h_can1_rx */
#define PB13H_CAN1_RX \
	PIC32CXSG_PINMUX(b, 13, h, periph)

/* pb13i_sdhc0_wp */
#define PB13I_SDHC0_WP \
	PIC32CXSG_PINMUX(b, 13, i, periph)

/* pb13j_iis_mck1 */
#define PB13J_IIS_MCK1 \
	PIC32CXSG_PINMUX(b, 13, j, periph)

/* pb13m_gclk_io7 */
#define PB13M_GCLK_IO7 \
	PIC32CXSG_PINMUX(b, 13, m, periph)

/* pb14_gpio */
#define PB14_GPIO \
	PIC32CXSG_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 \
	PIC32CXSG_PINMUX(b, 14, a, periph)

/* pb14b_ptc_xy28 */
#define PB14B_PTC_XY28 \
	PIC32CXSG_PINMUX(b, 14, b, periph)

/* pb14c_sercom4_pad2 */
#define PB14C_SERCOM4_PAD2 \
	PIC32CXSG_PINMUX(b, 14, c, periph)

/* pb14e_tc5_wo0 */
#define PB14E_TC5_WO0 \
	PIC32CXSG_PINMUX(b, 14, e, periph)

/* pb14f_tcc4_wo0 */
#define PB14F_TCC4_WO0 \
	PIC32CXSG_PINMUX(b, 14, f, periph)

/* pb14g_tcc0_wo2 */
#define PB14G_TCC0_WO2 \
	PIC32CXSG_PINMUX(b, 14, g, periph)

/* pb14h_can1_tx */
#define PB14H_CAN1_TX \
	PIC32CXSG_PINMUX(b, 14, h, periph)

/* pb14k_pcc_data8 */
#define PB14K_PCC_DATA8 \
	PIC32CXSG_PINMUX(b, 14, k, periph)

/* pb14l_gmac_gmdc */
#define PB14L_GMAC_GMDC \
	PIC32CXSG_PINMUX(b, 14, l, periph)

/* pb14m_gclk_io0 */
#define PB14M_GCLK_IO0 \
	PIC32CXSG_PINMUX(b, 14, m, periph)

/* pb14n_ccl_in9 */
#define PB14N_CCL_IN9 \
	PIC32CXSG_PINMUX(b, 14, n, periph)

/* pb15_gpio */
#define PB15_GPIO \
	PIC32CXSG_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 \
	PIC32CXSG_PINMUX(b, 15, a, periph)

/* pb15b_ptc_xy29 */
#define PB15B_PTC_XY29 \
	PIC32CXSG_PINMUX(b, 15, b, periph)

/* pb15c_sercom4_pad3 */
#define PB15C_SERCOM4_PAD3 \
	PIC32CXSG_PINMUX(b, 15, c, periph)

/* pb15e_tc5_wo1 */
#define PB15E_TC5_WO1 \
	PIC32CXSG_PINMUX(b, 15, e, periph)

/* pb15f_tcc4_wo1 */
#define PB15F_TCC4_WO1 \
	PIC32CXSG_PINMUX(b, 15, f, periph)

/* pb15g_tcc0_wo3 */
#define PB15G_TCC0_WO3 \
	PIC32CXSG_PINMUX(b, 15, g, periph)

/* pb15h_can1_rx */
#define PB15H_CAN1_RX \
	PIC32CXSG_PINMUX(b, 15, h, periph)

/* pb15k_pcc_data9 */
#define PB15K_PCC_DATA9 \
	PIC32CXSG_PINMUX(b, 15, k, periph)

/* pb15l_gmac_gmdio */
#define PB15L_GMAC_GMDIO \
	PIC32CXSG_PINMUX(b, 15, l, periph)

/* pb15m_gclk_io1 */
#define PB15M_GCLK_IO1 \
	PIC32CXSG_PINMUX(b, 15, m, periph)

/* pb15n_ccl_in10 */
#define PB15N_CCL_IN10 \
	PIC32CXSG_PINMUX(b, 15, n, periph)

/* pb16_gpio */
#define PB16_GPIO \
	PIC32CXSG_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 \
	PIC32CXSG_PINMUX(b, 16, a, periph)

/* pb16c_sercom5_pad0 */
#define PB16C_SERCOM5_PAD0 \
	PIC32CXSG_PINMUX(b, 16, c, periph)

/* pb16e_tc6_wo0 */
#define PB16E_TC6_WO0 \
	PIC32CXSG_PINMUX(b, 16, e, periph)

/* pb16f_tcc3_wo0 */
#define PB16F_TCC3_WO0 \
	PIC32CXSG_PINMUX(b, 16, f, periph)

/* pb16g_tcc0_wo4 */
#define PB16G_TCC0_WO4 \
	PIC32CXSG_PINMUX(b, 16, g, periph)

/* pb16i_sdhc1_cd */
#define PB16I_SDHC1_CD \
	PIC32CXSG_PINMUX(b, 16, i, periph)

/* pb16j_iis_sck0 */
#define PB16J_IIS_SCK0 \
	PIC32CXSG_PINMUX(b, 16, j, periph)

/* pb16m_gclk_io2 */
#define PB16M_GCLK_IO2 \
	PIC32CXSG_PINMUX(b, 16, m, periph)

/* pb16n_ccl_in11 */
#define PB16N_CCL_IN11 \
	PIC32CXSG_PINMUX(b, 16, n, periph)

/* pb17_gpio */
#define PB17_GPIO \
	PIC32CXSG_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 \
	PIC32CXSG_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 \
	PIC32CXSG_PINMUX(b, 17, c, periph)

/* pb17e_tc6_wo1 */
#define PB17E_TC6_WO1 \
	PIC32CXSG_PINMUX(b, 17, e, periph)

/* pb17f_tcc3_wo1 */
#define PB17F_TCC3_WO1 \
	PIC32CXSG_PINMUX(b, 17, f, periph)

/* pb17g_tcc0_wo5 */
#define PB17G_TCC0_WO5 \
	PIC32CXSG_PINMUX(b, 17, g, periph)

/* pb17i_sdhc1_wp */
#define PB17I_SDHC1_WP \
	PIC32CXSG_PINMUX(b, 17, i, periph)

/* pb17j_iis_mck0 */
#define PB17J_IIS_MCK0 \
	PIC32CXSG_PINMUX(b, 17, j, periph)

/* pb17m_gclk_io3 */
#define PB17M_GCLK_IO3 \
	PIC32CXSG_PINMUX(b, 17, m, periph)

/* pb17n_ccl_out3 */
#define PB17N_CCL_OUT3 \
	PIC32CXSG_PINMUX(b, 17, n, periph)

/* pb18_gpio */
#define PB18_GPIO \
	PIC32CXSG_PINMUX(b, 18, gpio, gpio)

/* pb18a_eic_extint2 */
#define PB18A_EIC_EXTINT2 \
	PIC32CXSG_PINMUX(b, 18, a, periph)

/* pb18c_sercom5_pad2 */
#define PB18C_SERCOM5_PAD2 \
	PIC32CXSG_PINMUX(b, 18, c, periph)

/* pb18d_sercom7_pad2 */
#define PB18D_SERCOM7_PAD2 \
	PIC32CXSG_PINMUX(b, 18, d, periph)

/* pb18f_tcc1_wo0 */
#define PB18F_TCC1_WO0 \
	PIC32CXSG_PINMUX(b, 18, f, periph)

/* pb18g_pdec_qdi0 */
#define PB18G_PDEC_QDI0 \
	PIC32CXSG_PINMUX(b, 18, g, periph)

/* pb18i_sdhc1_dat0 */
#define PB18I_SDHC1_DAT0 \
	PIC32CXSG_PINMUX(b, 18, i, periph)

