zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32cxsg61100-pinctrl.h
/* pb18m_gclk_io4 */
#define PB18M_GCLK_IO4 \
	PIC32CXSG_PINMUX(b, 18, m, periph)

/* pb19_gpio */
#define PB19_GPIO \
	PIC32CXSG_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 \
	PIC32CXSG_PINMUX(b, 19, a, periph)

/* pb19c_sercom5_pad3 */
#define PB19C_SERCOM5_PAD3 \
	PIC32CXSG_PINMUX(b, 19, c, periph)

/* pb19d_sercom7_pad3 */
#define PB19D_SERCOM7_PAD3 \
	PIC32CXSG_PINMUX(b, 19, d, periph)

/* pb19f_tcc1_wo1 */
#define PB19F_TCC1_WO1 \
	PIC32CXSG_PINMUX(b, 19, f, periph)

/* pb19g_pdec_qdi1 */
#define PB19G_PDEC_QDI1 \
	PIC32CXSG_PINMUX(b, 19, g, periph)

/* pb19i_sdhc1_dat1 */
#define PB19I_SDHC1_DAT1 \
	PIC32CXSG_PINMUX(b, 19, i, periph)

/* pb19m_gclk_io5 */
#define PB19M_GCLK_IO5 \
	PIC32CXSG_PINMUX(b, 19, m, periph)

/* pb20_gpio */
#define PB20_GPIO \
	PIC32CXSG_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 \
	PIC32CXSG_PINMUX(b, 20, a, periph)

/* pb20c_sercom3_pad0 */
#define PB20C_SERCOM3_PAD0 \
	PIC32CXSG_PINMUX(b, 20, c, periph)

/* pb20d_sercom7_pad1 */
#define PB20D_SERCOM7_PAD1 \
	PIC32CXSG_PINMUX(b, 20, d, periph)

/* pb20f_tcc1_wo2 */
#define PB20F_TCC1_WO2 \
	PIC32CXSG_PINMUX(b, 20, f, periph)

/* pb20g_pdec_qdi2 */
#define PB20G_PDEC_QDI2 \
	PIC32CXSG_PINMUX(b, 20, g, periph)

/* pb20i_sdhc1_dat2 */
#define PB20I_SDHC1_DAT2 \
	PIC32CXSG_PINMUX(b, 20, i, periph)

/* pb20m_gclk_io6 */
#define PB20M_GCLK_IO6 \
	PIC32CXSG_PINMUX(b, 20, m, periph)

/* pb21_gpio */
#define PB21_GPIO \
	PIC32CXSG_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 \
	PIC32CXSG_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 \
	PIC32CXSG_PINMUX(b, 21, c, periph)

/* pb21d_sercom7_pad0 */
#define PB21D_SERCOM7_PAD0 \
	PIC32CXSG_PINMUX(b, 21, d, periph)

/* pb21f_tcc1_wo3 */
#define PB21F_TCC1_WO3 \
	PIC32CXSG_PINMUX(b, 21, f, periph)

/* pb21i_sdhc1_dat3 */
#define PB21I_SDHC1_DAT3 \
	PIC32CXSG_PINMUX(b, 21, i, periph)

/* pb21m_gclk_io7 */
#define PB21M_GCLK_IO7 \
	PIC32CXSG_PINMUX(b, 21, m, periph)

/* pb22_gpio */
#define PB22_GPIO \
	PIC32CXSG_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 \
	PIC32CXSG_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 \
	PIC32CXSG_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 \
	PIC32CXSG_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 \
	PIC32CXSG_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 \
	PIC32CXSG_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof */
#define PB22H_USB_SOF \
	PIC32CXSG_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 \
	PIC32CXSG_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 \
	PIC32CXSG_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO \
	PIC32CXSG_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 \
	PIC32CXSG_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 \
	PIC32CXSG_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 \
	PIC32CXSG_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 \
	PIC32CXSG_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 \
	PIC32CXSG_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 \
	PIC32CXSG_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 \
	PIC32CXSG_PINMUX(b, 23, n, periph)

/* pb24_gpio */
#define PB24_GPIO \
	PIC32CXSG_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint8 */
#define PB24A_EIC_EXTINT8 \
	PIC32CXSG_PINMUX(b, 24, a, periph)

/* pb24c_sercom0_pad0 */
#define PB24C_SERCOM0_PAD0 \
	PIC32CXSG_PINMUX(b, 24, c, periph)

/* pb24d_sercom2_pad1 */
#define PB24D_SERCOM2_PAD1 \
	PIC32CXSG_PINMUX(b, 24, d, periph)

/* pb24g_pdec_qdi1 */
#define PB24G_PDEC_QDI1 \
	PIC32CXSG_PINMUX(b, 24, g, periph)

/* pb24m_ac_cmp0 */
#define PB24M_AC_CMP0 \
	PIC32CXSG_PINMUX(b, 24, m, periph)

/* pb25_gpio */
#define PB25_GPIO \
	PIC32CXSG_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint9 */
#define PB25A_EIC_EXTINT9 \
	PIC32CXSG_PINMUX(b, 25, a, periph)

/* pb25c_sercom0_pad1 */
#define PB25C_SERCOM0_PAD1 \
	PIC32CXSG_PINMUX(b, 25, c, periph)

/* pb25d_sercom2_pad0 */
#define PB25D_SERCOM2_PAD0 \
	PIC32CXSG_PINMUX(b, 25, d, periph)

/* pb25g_pdec_qdi2 */
#define PB25G_PDEC_QDI2 \
	PIC32CXSG_PINMUX(b, 25, g, periph)

/* pb25m_ac_cmp1 */
#define PB25M_AC_CMP1 \
	PIC32CXSG_PINMUX(b, 25, m, periph)

/* pb30_gpio */
#define PB30_GPIO \
	PIC32CXSG_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 \
	PIC32CXSG_PINMUX(b, 30, a, periph)

/* pb30d_sercom5_pad1 */
#define PB30D_SERCOM5_PAD1 \
	PIC32CXSG_PINMUX(b, 30, d, periph)

/* pb30e_tc0_wo0 */
#define PB30E_TC0_WO0 \
	PIC32CXSG_PINMUX(b, 30, e, periph)

/* pb30f_tcc4_wo0 */
#define PB30F_TCC4_WO0 \
	PIC32CXSG_PINMUX(b, 30, f, periph)

/* pb30g_tcc0_wo6 */
#define PB30G_TCC0_WO6 \
	PIC32CXSG_PINMUX(b, 30, g, periph)

/* pb30h_swd_swo */
#define PB30H_SWD_SWO \
	PIC32CXSG_PINMUX(b, 30, h, periph)

/* pb31_gpio */
#define PB31_GPIO \
	PIC32CXSG_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 \
	PIC32CXSG_PINMUX(b, 31, a, periph)

/* pb31d_sercom5_pad0 */
#define PB31D_SERCOM5_PAD0 \
	PIC32CXSG_PINMUX(b, 31, d, periph)

/* pb31e_tc0_wo1 */
#define PB31E_TC0_WO1 \
	PIC32CXSG_PINMUX(b, 31, e, periph)

/* pb31f_tcc4_wo1 */
#define PB31F_TCC4_WO1 \
	PIC32CXSG_PINMUX(b, 31, f, periph)

/* pb31g_tcc0_wo7 */
#define PB31G_TCC0_WO7 \
	PIC32CXSG_PINMUX(b, 31, g, periph)

/* pc0_gpio */
#define PC0_GPIO \
	PIC32CXSG_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint0 */
#define PC0A_EIC_EXTINT0 \
	PIC32CXSG_PINMUX(c, 0, a, periph)

/* pc0b_adc1_ain10 */
#define PC0B_ADC1_AIN10 \
	PIC32CXSG_PINMUX(c, 0, b, periph)

/* pc1_gpio */
#define PC1_GPIO \
	PIC32CXSG_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extint1 */
#define PC1A_EIC_EXTINT1 \
	PIC32CXSG_PINMUX(c, 1, a, periph)

/* pc1b_adc1_ain11 */
#define PC1B_ADC1_AIN11 \
	PIC32CXSG_PINMUX(c, 1, b, periph)

/* pc2_gpio */
#define PC2_GPIO \
	PIC32CXSG_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint2 */
#define PC2A_EIC_EXTINT2 \
	PIC32CXSG_PINMUX(c, 2, a, periph)

